Trabalho de Inteligência Artificial.
Alunos: Jairo Sousa e Lucas Prado

In [11]:
# importando a biblioteca Pandas do Python
import pandas as pd

In [12]:
# criando o objeto dataframe com todos os registros do banco de dados
dataframe = pd.DataFrame(data=pd.read_csv("dataset/aluguel.csv", encoding = "UTF-8", sep = ";"))

#1. Crie um dataframe contendo apenas o seu tipo de imóveis. Ajuste os rótulo de linhas do dataframe

In [13]:
dataframe_aptos = dataframe.loc[dataframe["Tipo"] == "Apartamento"]
linhas = list(range(19532))
dataframe_aptos.index = linhas
dataframe_aptos

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
2,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
3,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
4,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19527,Apartamento,Vila Valqueire,2,0,0,52,1000.0,550.0,NaN
19528,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
19529,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
19530,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
19531,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

#2. Para o novo dataframe, proponha 5 possíveis seleções. Para cada seleção proposta, deixe um comentário no código explicando que o objetivo da seleção. Exemplo: Selecionar pacientes cujo diagnóstico é doente.

In [14]:
# Primeira - Selecionar apartamentos que não possuem suíte
dataframe_aptos.loc[dataframe_aptos["Suites"] == 0]

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
2,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
3,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
4,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19526,Apartamento,Tijuca,1,0,0,28,1000.0,360.0,25.0
19527,Apartamento,Vila Valqueire,2,0,0,52,1000.0,550.0,NaN
19528,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
19530,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
19531,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

In [15]:
# Segunda - Apartamentos com mais de 2 quartos, para famílias maiores
dataframe_aptos.loc[dataframe_aptos["Quartos"] >= 2]

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
2,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
3,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
5,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0
6,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0
8,Apartamento,Copacabana,4,3,1,243,13000.0,2000.0,803.0
...,...,...,...,...,...,...,...,...,...
19527,Apartamento,Vila Valqueire,2,0,0,52,1000.0,550.0,NaN
19528,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
19529,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
19530,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
19531,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

In [16]:
# Terceira - Apartamentos com valor de IPTU igual ou menor que R$100,00
dataframe_aptos.loc[dataframe_aptos["IPTU"] <= 100.00]

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
5,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0
6,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0
7,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0
...,...,...,...,...,...,...,...,...,...
19519,Apartamento,Copacabana,1,0,0,50,1950.0,450.0,70.0
19526,Apartamento,Tijuca,1,0,0,28,1000.0,360.0,25.0
19528,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
19529,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
19530,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0

In [17]:
# Quarta - Apartamentos com 2 quartos ou mais, com aluguel menor que R$1.000,00
dataframe_aptos.loc[((dataframe_aptos["Quartos"] >= 2) & (dataframe_aptos["Valor"] <= 1000.00))]

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
9,Apartamento,Freguesia (Jacarepaguá),3,0,0,54,950.0,300.0,28.0
12,Apartamento,Olaria,3,1,0,68,1000.0,670.0,NaN
48,Apartamento,Cachambi,2,0,0,60,1000.0,380.0,280.0
52,Apartamento,Vila Valqueire,2,1,0,45,800.0,280.0,14.0
64,Apartamento,Itanhangá,2,1,0,60,1000.0,450.0,150.0
...,...,...,...,...,...,...,...,...,...
19491,Apartamento,Irajá,2,1,0,50,900.0,300.0,NaN
19512,Apartamento,Campinho,2,0,0,63,800.0,392.0,NaN
19513,Apartamento,Freguesia (Jacarepaguá),2,1,0,60,500.0,900.0,148.0
19527,Apartamento,Vila Valqueire,2,0,0,52,1000.0,550.0,NaN
19528,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0

In [18]:
#Quinta - Apartamentos em ordem do maior para menor valor de condomínio
dataframe_aptos.sort_values(by=['Condominio'],ascending=False)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
10616,Apartamento,Barra da Tijuca,2,1,1,104,3800.0,6552570.0,655.0
12820,Apartamento,Lins de Vasconcelos,2,1,0,78,1200.0,519000.0,135.0
4699,Apartamento,Barra da Tijuca,4,2,2,115,3900.0,129880.0,358.0
5274,Apartamento,Jardim Guanabara,2,1,0,65,1600.0,50500.0,97.0
18209,Apartamento,Engenho Novo,2,1,0,50,1000.0,43593.0,NaN
...,...,...,...,...,...,...,...,...,...
19318,Apartamento,Copacabana,3,0,0,130,4600.0,NaN,NaN
19343,Apartamento,Guadalupe,1,0,0,40,550.0,NaN,NaN
19357,Apartamento,Bonsucesso,1,0,0,60,1000.0,NaN,NaN
19384,Apartamento,Flamengo,2,0,0,59,3500.0,NaN,NaN
19442,Apartamento,Cascadura,3,0,1,70,1200.0,NaN,NaN

#3. Chame o método info() para o novo dataframe, para que seja possível verificar quais atributos possuem dados faltantes. Para cada atributo com dados faltante gere um dataframe para exibi-los (utilize o método isnull()).

In [19]:
#Mostrando informações sobre as colunas para descobrir quais colunas possuem valores zerados
dataframe_aptos.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19532 entries, 0 to 19531
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        19532 non-null  object
 1   Bairro      19532 non-null  object
 2   Quartos     19532 non-null  int64
 3   Vagas       19532 non-null  int64
 4   Suites      19532 non-null  int64
 5   Area        19532 non-null  int64
 6   Valor       19525 non-null  float64
 7   Condominio  18787 non-null  float64
 8   IPTU        14060 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.5+ MB

In [20]:
#Montando um dataframe com as linhas em que o Valor do Aluguel é nulo
dataframe_aptos_valor_null = dataframe_aptos[dataframe_aptos['Valor'].isnull()]
dataframe_aptos_valor_null

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
47,Apartamento,Barra da Tijuca,2,1,1,70,NaN,970.0,68.0
1287,Apartamento,Leme,2,0,0,75,NaN,878.0,NaN
1743,Apartamento,Botafogo,2,0,0,95,NaN,1010.0,170.0
1764,Apartamento,Copacabana,2,0,0,72,NaN,850.0,NaN
7440,Apartamento,Leme,2,0,1,75,NaN,878.0,NaN
7780,Apartamento,Glória,3,0,1,135,NaN,910.0,228.0
7950,Apartamento,Gávea,3,1,1,105,NaN,880.0,221.0

In [21]:
#Montando um dataframe com as linhas em que o Valor do Condomínio é nulo
dataframe_aptos_condominio_null = dataframe_aptos[dataframe_aptos['Condominio'].isnull()]
dataframe_aptos_condominio_null

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
2,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
4,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
68,Apartamento,Praça Seca,2,0,0,80,1000.0,NaN,NaN
97,Apartamento,Rocha Miranda,2,1,0,50,1100.0,NaN,NaN
112,Apartamento,Barra da Tijuca,1,1,1,65,2350.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
19318,Apartamento,Copacabana,3,0,0,130,4600.0,NaN,NaN
19343,Apartamento,Guadalupe,1,0,0,40,550.0,NaN,NaN
19357,Apartamento,Bonsucesso,1,0,0,60,1000.0,NaN,NaN
19384,Apartamento,Flamengo,2,0,0,59,3500.0,NaN,NaN
19442,Apartamento,Cascadura,3,0,1,70,1200.0,NaN,NaN

In [22]:
#Montando um dataframe com as linhas em que o Valor do IPTU é nulo
dataframe_aptos_IPTU_null = dataframe_aptos[dataframe_aptos['IPTU'].isnull()]
dataframe_aptos_IPTU_null

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
2,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
4,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
12,Apartamento,Olaria,3,1,0,68,1000.0,670.0,NaN
13,Apartamento,Tijuca,2,1,0,78,2000.0,700.0,NaN
...,...,...,...,...,...,...,...,...,...
19505,Apartamento,Flamengo,1,0,0,48,2200.0,478.0,NaN
19512,Apartamento,Campinho,2,0,0,63,800.0,392.0,NaN
19523,Apartamento,Recreio dos Bandeirantes,3,2,1,88,1550.0,790.0,NaN
19527,Apartamento,Vila Valqueire,2,0,0,52,1000.0,550.0,NaN
19531,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

#4. Para cada dado faltante analise se eles podem ser removidos ou preenchidos com algum valor. Trate os dados faltantes e justifique o tratamento feito. 
Estratégia: Os dados faltantes foram de valor do aluguel, valor do condomínio, e valor do IPTU. Como tais valores possuem relação com fatores relacionados à área do apartamento e até à localização do mesmo, ficaria muito difícil determinar valores a substituir. Com isso em vista, e sabendo que mesmo que os registros com valores faltantes sejam removidos, ainda sobrariam bastantes valores, optou-se remover os registros com valores faltantes.

In [23]:
dataframe_aptos.dropna(subset=['Valor'], inplace=True)
dataframe_aptos.dropna(subset=['Condominio'], inplace=True)
dataframe_aptos.dropna(subset=['IPTU'], inplace=True)
dataframe_aptos

<ipython-input-23-e2ede91f8f5b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataframe_aptos.dropna(subset=['Valor'], inplace=True)
<ipython-input-23-e2ede91f8f5b>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataframe_aptos.dropna(subset=['Condominio'], inplace=True)
<ipython-input-23-e2ede91f8f5b>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataframe_aptos.dropna(subset=['IPTU'], inplace=True)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
5,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0
6,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0
7,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0
...,...,...,...,...,...,...,...,...,...
19525,Apartamento,Ipanema,3,1,2,150,15000.0,1400.0,600.0
19526,Apartamento,Tijuca,1,0,0,28,1000.0,360.0,25.0
19528,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
19529,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
19530,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0

#5. Proponha 2 possíveis transformações para o dataframe utilizando os métodos apply() e/ou map().

In [24]:
#Mudar os apartamentos onde Suítes = 0 para "Não possui"
#Definição da função auxiliar para transformação dos dados:
def suites0toNaoPossui(n):
  if n == 0:
    return 'Nao possui'
  else:
    return n

#Transformação dos dados e visualização:
dataframe_aptos['Suites'] = dataframe_aptos['Suites'].apply(suites0toNaoPossui)
dataframe_aptos

<ipython-input-24-f4abc8d069ca>:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataframe_aptos['Suites'] = dataframe_aptos['Suites'].apply(suites0toNaoPossui)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Apartamento,Centro,1,0,Nao possui,15,800.0,390.0,20.0
3,Apartamento,Cachambi,2,0,Nao possui,50,1300.0,301.0,17.0
5,Apartamento,Grajaú,2,1,Nao possui,70,1500.0,642.0,74.0
6,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0
7,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0
...,...,...,...,...,...,...,...,...,...
19525,Apartamento,Ipanema,3,1,2,150,15000.0,1400.0,600.0
19526,Apartamento,Tijuca,1,0,Nao possui,28,1000.0,360.0,25.0
19528,Apartamento,Méier,2,0,Nao possui,70,900.0,490.0,48.0
19529,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
19530,Apartamento,São Francisco Xavier,2,1,Nao possui,48,1400.0,509.0,37.0

In [25]:
#Mudar os apartamentos onde Vagas = 0 para "Sem vagas"
#Definição da função auxiliar para transformação dos dados:
def vagas0toSemVagas(n):
  if n == 0:
    return 'Sem Vagas'
  else:
    return n

#Transformação dos dados e visualização:
dataframe_aptos['Vagas'] = dataframe_aptos['Vagas'].apply(vagas0toSemVagas)
dataframe_aptos

<ipython-input-25-a91f6d6b3827>:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataframe_aptos['Vagas'] = dataframe_aptos['Vagas'].apply(vagas0toSemVagas)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Apartamento,Centro,1,Sem Vagas,Nao possui,15,800.0,390.0,20.0
3,Apartamento,Cachambi,2,Sem Vagas,Nao possui,50,1300.0,301.0,17.0
5,Apartamento,Grajaú,2,1,Nao possui,70,1500.0,642.0,74.0
6,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0
7,Apartamento,Copacabana,1,Sem Vagas,1,40,2000.0,561.0,50.0
...,...,...,...,...,...,...,...,...,...
19525,Apartamento,Ipanema,3,1,2,150,15000.0,1400.0,600.0
19526,Apartamento,Tijuca,1,Sem Vagas,Nao possui,28,1000.0,360.0,25.0
19528,Apartamento,Méier,2,Sem Vagas,Nao possui,70,900.0,490.0,48.0
19529,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
19530,Apartamento,São Francisco Xavier,2,1,Nao possui,48,1400.0,509.0,37.0

#6. Salve o dataframe final na extensão csv, contendo apenas o seu tipo de imóveis, os tratamentos dos dados faltantes e as transformações feitas

In [26]:
dataframe_aptos.to_csv ('dataframe_aptos_saida.csv', index = None, header=True)